# InaccuracyDetected Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..InaccuracyDetected Property
BuiltInFailures..::..GeneralFailures Class See Also
---
A geometric inaccuracy was found in the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InaccuracyDetected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InaccuracyDetected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InaccuracyDetected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace